# vim: syntax=ruby filetype=ruby

# Lets us do `brew services restart postgres`, etc
tap 'homebrew/services'

# Old versions of some packages
tap 'homebrew/versions'

brew 'coreutils'

# Use version 3.4+ for colorful diffs with --color
brew 'diffutils'

# so :Rtags works
brew 'ctags'

# My favorite editor
brew 'neovim'

# Fast GitHub client, used in git-create-pull-request
brew 'hub'

# Don't install completions, in favor of using Zsh's (better) git completions
brew 'git', args: ['--without-completions']

# Fuzzy finder
brew 'fzf'

# thoughtbot stuff like rcm
tap 'thoughtbot/formulae'
brew 'rcm'
brew 'parity'

# Fast, hip replacement for grep
brew 'ripgrep'

# Official AWS CLI
brew 'awscli'

# Like search, but more elastic
brew 'elasticsearch'

# https://tldr.sh/
# Man pages, but with practical examples.
brew 'tldr'

brew 'node'
brew 'nvim'
brew 'yarn'
brew 'nvm'
brew "unused"
brew "htop"
brew 'tmux'
brew 'python3'
brew 'ack'
brew 'hub'
